app/Controllers/AuthController.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();

        if ($data) {
            $pass = $data['password'];
            $verify_pass = password_verify($password, $pass);

            if ($verify_pass) {

                $ses_data = [
                    'id_user'    => $data['id_user'],
                    'username'   => $data['username'],
                    'role'       => $data['role'],
                    'isLoggedIn' => true
                ];

                // Ambil detail pengurus kalau role pengurus atau ketua
                if ($data['role'] === 'pengurus' || $data['role'] === 'ketua') {

                    $pengurusModel = new PengurusModel();

                    $detailPengurus = $pengurusModel
                        ->where('id_pengurus', $data['id_pengurus'])
                        ->first();
---
SELECT *
FROM `user`
WHERE `username` = '240444040003'
 LIMIT 1
SELECT *
FROM `pengurus`
WHERE `id_pengurus` = '5'
 LIMIT 1