app/Controllers/PesertaController.php

    public function index()
    {
        $data = [
            'title'   => 'Daftar Peserta',
            'peserta' => $this->PesertaModel->findAll()
---
SELECT *
FROM `peserta`