app/Controllers/UserController.php

    public function index()
    {
        $data = [
            'title'    => 'Manajemen User',
            'users'    => $this->userModel->findAll(),
            'peserta'  => $this->pesertaModel->findAll(),
            'pengajar' => $this->pengajarModel->findAll(),
            'pengurus' => $this->pengurusModel->findAll(),
---
SELECT *
FROM `user`
SELECT *
FROM `peserta`
SELECT *
FROM `pengajar`
SELECT *
FROM `pengurus`